[
    {
      "title":"Solo Leveling",
      "desc":"In this world where Hunters with various magical powers battle monsters from invading the defenseless humanity, Seong Jin-Woo was the weakest of all the Hunters, barely able to make a living.However, a mysterious System grants him the power of the 'Player', setting him on a course for an incredible and often times perilous Journey.Follow Sang Jin-Woo as he embarks on an adventure to become an unparalleled existence through his “Level-Up” system - the only one in the entire world!",
      "genre":"Fantasy",
      "price":130,
      "Original_price":"300",
      "uses":"6 months",
      "seller_name":"Eshan Benjamin",
      "seller_phone":"01303694937",
      "seller_location":"Dhaka",
      "currier":true,
      "condition":"good",
      "images":[
        "https://i.ebayimg.com/images/g/he8AAOSwOFdfO4BO/s-l640.jpg","https://cf.shopee.ph/file/15dc7675b68a19e0946ed0a264e1648d",
        "https://i.redd.it/5ty1z7tdg1o61.jpg"
      ],
      "author":"",
      "post_time":"2022-11-24T04:49:44.001Z"
    },
    {
      "title": "The Lord Of The Rings - saga",
      "desc": "One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins.From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings, but always he searched for the One Ring that would complete his dominion.When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom.The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider.",
      "genre": "Fantasy",
      "price": 230,
      "Original_price": "400",
      "uses": "9 months",
      "seller_name": "marks gayman",
      "seller_phone": "01303694937",
      "seller_location": "Dhaka",
      "currier": true,
      "condition": "good",
      "images": [
        "https://www.foliosociety.com/media/catalog/product/l/t/ltr_book.png?quality=80&fit=bounds&height=&width=&canvas=:",
        "https://i.ytimg.com/vi/u_Z3og0AefY/maxresdefault.jpg",
        "https://cdn.shopify.com/s/files/1/0024/6874/1219/products/LordOfTheRings4BooksBoxed-9780007581146-B2D0628-Open_700x700.jpg?v=1618581563"
      ],
      "author": "J.R.R. Tolkien ",
      "post_time": "2022-10-24T04:49:44.001Z"
    },
    {
      "title": "রবীন্দ্রনাথ এখানে কখনও খেতে আসেননি",
      "desc": "মফস্বল শহর সুন্দরপুর। ছবির মতই সুন্দর। প্রকৃতির শোভা ছাড়া উল্লেখযোগ্য আর কিছু নেই বললেই চলে, কিন্তু সবাই জানে রবীন্দ্রনাথ এখানে কখনো খেতে আসেন নি! কেন আসেননি, তারচেয়েও বড় কথা কেন অনেকেই সেখানে ছুটে আসে! এক আগন্তুক এসে হাজির হল সেই সুন্দরপুরে। তার গতিবিধি অস্পষ্ট আর রহস্যময়। সে যেটা জানতে চায় সেটা ওখানকার খুব কম লোকেই জানে। আর যখন সেটা জানা গেল তখন বেরিয়ে এল রোমহর্ষক এক কাহিনী। পরিহাসের ব্যাপার হল সেই রোমহর্ষক কাহিনী কাউকে বলার মত সুযোগ সত্যি কঠিন! ",
      "genre": "Thriller",
      "price": 100,
      "Original_price": "300",
      "uses": "1 year",
      "seller_name": "Sanjid ahamed",
      "seller_phone": "01303694937",
      "seller_location": "Dhaka",
      "currier": true,
      "condition": "good",
      "images": [
        "https://konthonir.com/wp-content/uploads/2021/05/1621417431636-768x1024.jpg",
        "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1548607223l/43634944.jpg",
        "https://sg-test-11.slatic.net/other/roc/00f0490ad045a85b8e4ed90ca029065a.jpg"
      ],
      "author": " Mohammad Nazim Uddin ",
      "post_time": "2022-11-22T04:49:44.001Z"
    },
    {
      "title": "The Da Vinci Code",
      "desc": "While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter.Even more startling, the late curator was involved in the Priory of Sion—a secret society whose members included Sir Isaac Newton, Victor Hugo, and Da Vinci—and he guarded a breathtaking historical secret. Unless Langdon and Neveu can decipher the labyrinthine puzzle—while avoiding the faceless adversary who shadows their every move—the explosive, ancient truth will be lost forever. ",
      "genre": "Thriller",
      "price": 200,
      "Original_price": "300",
      "uses": "1 year",
      "seller_name": "Sanjid ahamed",
      "seller_phone": "01303694937",
      "seller_location": "Dhaka",
      "currier": true,
      "condition": "good",
      "images": [
        "https://threepennypress.org/wp-content/uploads/2020/11/IMG_1695-900x797.jpeg",
        "https://sincerelyyoursannie.files.wordpress.com/2022/01/da-vinci-fi.png?w=863&h=0&crop=1"
      ],
      "author": "Dan Brown",
      "post_time": "2022-11-20T04:49:44.001Z"
    },
    {
      "title": "The Fault in Our Stars",
      "desc": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love",
      "genre": "Romantic",
      "price": 200,
      "Original_price": "300",
      "uses": "1 year",
      "seller_name": "Sanjid ahamed",
      "seller_phone": "01303694937",
      "seller_location": "Dhaka",
      "currier": true,
      "condition": "good",
      "images": [
        "https://abeautifulmess.com/wp-content/uploads/typekit/.a/6a00d8358081ff69e201a73d82e6d3970d-800wi",
        "https://i1.wp.com/www.spaceplaceandsoutherngrace.com/wp-content/uploads/2014/02/tfios.jpg?fit=607%2C612&ssl=1",
        "https://cf.shopee.com.br/file/c775ae9e1efe9b300f20d5c0245f0c12"
      ],
      "author": " John Green",
      "post_time": "2022-10-22T04:49:44.001Z"
    },
    {
      "title":"Norwegian Wood",
      "desc":"Toru, a quiet and preternaturally serious young college student in Tokyo, is devoted to Naoko, a beautiful and introspective young woman, but their mutual passion is marked by the tragic death of their best friend years before. Toru begins to adapt to campus life and the loneliness and isolation he faces there, but Naoko finds the pressures and responsibilities of life unbearable. As she retreats further into her own world, Toru finds himself reaching out to others and drawn to a fiercely independent and sexually liberated young woman.A magnificent blending of the music, the mood, and the ethos that was the sixties with the story of one college student's romantic coming of age, Norwegian Wood brilliantly recaptures a young man's first, hopeless, and heroic love.",
      "genre":"Romantic",
      "price":200,
      "Original_price":"300",
      "uses":"1 year",
      "seller_name":"Sanjid ahamed",
      "seller_phone":"01303694937",
      "seller_location":"Dhaka",
      "currier":true,
      "condition":"good",
      "images":[
        "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1492769344l/818108._SY475_.jpg","https://bookishloom.files.wordpress.com/2020/04/img_20200416_114748.jpg?w=894","https://www.carillonregina.com/wp-content/uploads/2015/03/3A-Laura-Billett.jpg"
      ],
      "author":" Haruki Murakami,",
      "post_time":"2022-10-21T04:49:44.001Z"
    }
]